#include <stdio.h>

int	main(void) {
	int	a[5][6] = {
		{ 1, 2, 3, 4, 5, },
		{ 6, 7, 8, 9, 10, },
		{ 11, 12, 13, 14, 15, },
		{ 16, 17, 18, 19, 20, },
		{ 0, },
	};

	int	i, j;
//	등차수열이 아니라면 이 방법.
//	int	sum = 0;
//	for (i = 0; i < 4; ++i) {
//		for (j = 0; j < 5; ++j) {
//			a[i][5] += a[i][j];
//			a[4][j] += a[i][j];
//			sum += a[i][j];
//		}
//	}
//	a[4][5] = sum;
// 등차수열이라면 이 방법.
	for (i = 0; i < 4; ++i) {
		a[i][5] = (a[i][0] + a[i][4]) * 5 / 2;
	}
	for (j = 0; j < 5; ++j) {
		a[4][j] = (a[0][j] + a[3][j]) * 2;
	}
	a[4][5] = (a[4][0] + a[4][4]) * 5 / 2;

	for (i = 0; i < 5; ++i) {
		for (j = 0; j < 6; ++j) {
			printf("%5d", a[i][j]);
		}
		printf("\n");
	}
}
